# UtilizationCoefficientOutOfRange Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..UtilizationCoefficientOutOfRange Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
The value for Coefficient of Utilization must be between 0 and 1.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UtilizationCoefficientOutOfRange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UtilizationCoefficientOutOfRange As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UtilizationCoefficientOutOfRange {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace